---
type: TableCellCalculatedValueData
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# TableCellCalculatedValueData

`Autodesk.Revit.DB.TableCellCalculatedValueData` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetName | — | `public string GetName ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |